#include "Book.h"
#include "Libraria.h"
#include <iostream>

Book::Book()
{
    //Початкові параметри, для книги
    location = ON_SHELF;
    checkedOutBy = NULL;
    requestedBy = NULL;
    dateCheckedOut = -1;
}

/******************************************************************************
* Вхід: Тут знаходяться 3 строкові параметри, де перший унікальний номер книги
*        Другий це назва книги і третій це автор книги
*
* Вихід: Ініціалізація інформацію про книгу
*
* Мета: конструктор з аргументами
******************************************************************************/
Book::Book(std::string idc, std::string t, std::string a)
{
    //Початкові параметра конструктора для нової книги
    idCode = idc;//код книги
    title = t;//назва
    author = a;//автор
    location = ON_SHELF;//позиція
    checkedOutBy = NULL;//Ким взята
    requestedBy = NULL;//Кого інтересує
    dateCheckedOut = -1;// Кількість днів на руках
}

/******************************************************************************
* Вхід: Один парамерт з парметром іd книги
*
* Вихід: знаходить книгу з відповідним id і повертає вказівник на неї
*
* Мета: виведення відповідної книги з вектора книг
******************************************************************************/


Book* Library::bookCheck(std::string bookID)
{
    int bookPos = -1; // позиція книги з відповідним ID

    for (int i = 0; i < holdings.size(); i++)//Для кожної книги
    {
        if (holdings[i].getIdCode() == bookID)//Якщо код книги дорівнює відповідному
        {
            bookPos = i;//позиція рівна і
        }
    }
    if (bookPos < 0)//якщо позиція відємна, то пустота
        return NULL;
    else
        return &holdings[bookPos];//повертаємо вказіник книги на її позицію
}

